In [336]:
import pandas as pd
import numpy as np
from sklearn import preprocessing
from scipy.stats import chi2_contingency
import re

In [329]:
lusitania_data_location = '/Users/toddmoffett1/DSI/dsi_workspace/project-2/assets/lusitania.csv'
#df = pd.read_csv(lusitania_data_location)

In [421]:
df.head(5)

    fate   age pclass status Cabin No.   Sex  sex  survived  deceased
0   Lost  38.0   Crew    NaN       NaN  Male    1         0         1
1   Lost  37.0   Crew    NaN       NaN  Male    1         0         1
2  Saved  30.0   Crew    NaN       NaN  Male    1         1         0
3  Saved  25.0   Crew    NaN       NaN  Male    1         1         0
4  Saved  27.0   Crew    NaN       NaN  Male    1         1         0

# Data Cleaning

### Drop Features/Columns

In [326]:
#df.drop('Survived', axis=1, inplace=True)
#df.drop('Title', axis=1, inplace=True)
#df.drop('Faily name', axis=1, inplace=True)
#df.drop('Personal name', axis=1, inplace=True)
#df.drop('Traveling Companions and other notes', axis=1, inplace=True)
#df.drop('Body No.', axis=1, inplace=True)
#df.drop('Passenger/Crew', axis=1, inplace=True)
#df.drop('Survived', axis=1, inplace=True)

### Fixed Age

In [14]:
#df['Age'] = df['Age'].str.replace(' \?','.0')
#df['Age'] = df['Age'].str.replace('(\d\d)\?','\\1')
#df['Age'] = df['Age'].str.replace('(\d)\?','\\1')
#df['Age'] = df['Age'].str.replace('(...\d\d)','\\1')
#df['Age'] = df['Age'].str.replace('\?','30')
#df['Age'] = df['Age'].str.replace('2_','20')
#df['Age'] = df['Age'].str.replace('..-months','1')
#df['Age'] = df['Age'].str.replace('Infant','1')
#df['Age'] = df['Age'].str.replace('45 or 51','47')
#df['Age'] = df['Age'].str.replace('51 or 47','49')
#df['Age'] = df['Age'].str.replace('(\d\d)..(\d\d).','\\1')
#df['Age'] = df['Age'].str.replace('(\d)..(\d).','\\1')

### Replace Values and Features

In [243]:
#df['Fate'] = df['Fate'].str.replace('Saved \(died from trauma\)','Lost')
#df['Department/Class_temp'] = df['Department/Class_temp'].str.replace('Deck','Crew')
#df['Department/Class_temp'] = df['Department/Class_temp'].str.replace('Engineering','Crew')
#df['Department/Class_temp'] = df['Department/Class_temp'].str.replace('Victualling','Crew')
#df['Department/Class_temp'] = df['Department/Class_temp'].str.replace('Third \(Distressed British Seaman\)','Third')
#df['Department/Class_temp'] = df['Department/Class_temp'].str.replace('Saloon','First')

In [228]:
#df['Age'] = df['Ages']

### Binary value for string features

In [ ]:
#df['Survived'] = df['Fate'].apply(lambda x: 1 if x == 'Saved' else 0)

In [322]:
#df['deceased'] = df['Fate'].apply(lambda x: 1 if x == 'Lost' else 0)

In [267]:
# from sklearn import preprocessing
#lb = preprocessing.LabelBinarizer()
#df['sexes'] = lb.fit_transform(df['Sex'])

# Data Filtering

### Passenger Data

In [354]:
passengers = df[(df['pclass'] != 'Crew')]

In [360]:
passengers.head()

,fate,age,pclass,status,Cabin No.,Sex,sex,survived,deceased
387,Saved,19.0,First,Single,D 45,Male,1,1,0
388,Lost,46.0,First,Married,D 37,Male,1,0,1
389,Lost,58.0,First,Married,B 27,Male,1,0,1
390,Saved,46.0,First,Married,B 27,Female,0,1,0
391,Saved,42.0,First,Married,"B 47, B 49 (regal suite and bath)",Female,0,1,0

In [402]:
np.mean(passengers['age'])

31.97848731884058

In [415]:
np.sum((passengers['Sex'] == "Male"))

775

In [416]:
np.sum((passengers['Sex'] == 'Female'))

493

### Crew Data

In [395]:
crew = df[(df['pclass'] == 'Crew')]

In [396]:
crew.head()

    fate   age pclass status Cabin No.   Sex  sex  survived  deceased
0   Lost  38.0   Crew    NaN       NaN  Male    1         0         1
1   Lost  37.0   Crew    NaN       NaN  Male    1         0         1
2  Saved  30.0   Crew    NaN       NaN  Male    1         1         0
3  Saved  25.0   Crew    NaN       NaN  Male    1         1         0
4  Saved  27.0   Crew    NaN       NaN  Male    1         1         0

In [419]:
np.mean(crew['age'])

34.181372549019606

In [417]:
np.sum((crew['Sex'] == "Male"))

668

In [418]:
np.sum((crew['Sex'] == "Female"))

25

# Data Tables

In [394]:
sex_age = df.pivot_table(index=['sex','pclass'], values=['age'] , aggfunc=np.mean)#, margins=True, margins_name='Total')
sex_age

                    age
sex pclass
0   Crew      37.523810
    First     37.011628
    Second    29.595652
    Third     28.927184
1   Crew      33.797814
    First     39.877551
    Second    29.165236
    Stowaway        NaN
    Third     30.168945

In [400]:
np.mean(crew['age'])

34.181372549019606

In [216]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1961 entries, 0 to 1960
Data columns (total 7 columns):
Fate                1961 non-null object
Age                 1308 non-null object
Department/Class    1961 non-null object
Status              795 non-null object
Cabin No.           329 non-null object
Sex                 1961 non-null object
all_ages            1308 non-null float64
dtypes: float64(1), object(6)
memory usage: 107.3+ KB

In [406]:
passenger_survive_total = passengers.pivot_table(values=['deceased','survived'], index=['sex','pclass'], aggfunc=[np.sum, np.mean],  margins_name='Total', margins=True)
passenger_survive_total

                  sum               mean
             deceased survived  deceased  survived
sex pclass
0   First        57.0     34.0  0.626374  0.373626
    Second      186.0    108.0  0.632653  0.367347
    Third        68.0     40.0  0.629630  0.370370
1   First       122.0     78.0  0.610000  0.390000
    Second      188.0    119.0  0.612378  0.387622
    Stowaway      3.0      0.0  1.000000  0.000000
    Third       171.0     94.0  0.645283  0.354717
All             795.0    473.0  0.626972  0.373028

In [376]:
class_survive = pd.crosstab(passengers['pclass'] ,passengers['survived'])
class_survive

survived    0    1
pclass
First     179  112
Second    374  227
Stowaway    3    0
Third     239  134

In [384]:
chisq_value, pvalue, dof, expected = chi2_contingency(class_survive)

In [385]:
print 'expected', expected

print ('chi score', chisq_value)

print ('pvalue', pvalue)

expected [[ 182.44873817  108.55126183]
 [ 376.80993691  224.19006309]
 [   1.88091483    1.11908517]
 [ 233.86041009  139.13958991]]
('chi score', 2.3186388023635582)
('pvalue', 0.50895961443200899)

In [386]:
sex_survive = pd.crosstab(passengers['Sex'] ,passengers['survived'])
sex_survive

survived    0    1
Sex
Female    311  182
Male      484  291

In [387]:
chisq_value, pvalue, dof, expected = chi2_contingency(sex_survive)

In [408]:
#print 'expected', expected

print 'chi score', chisq_value

print 'pvalue', pvalue

chi score 0.0279314999598
pvalue 0.867269966891